olliw42/stm32ll-lib/src/stdstm32-uartf.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UARTF_USE_UART1, UARTF_USE_UART1_PA9PA10, UARTF_USE_UART1_PB6PB7, UARTF_USE_UART1_PC4PC5
// #define UARTF_USE_UART2, UARTF_USE_UART2_PA2PA3, UARTF_USE_UART2_PD5PD6, UARTF_USE_UART2_PB3PB4, UARTF_USE_UART2_PA14PA15
// #define UARTF_USE_UART3, UARTF_USE_UART3_PB10PB11, UARTF_USE_UART3_PC10PC11, UARTF_USE_UART3_PB8PB9
// #define UARTF_USE_UART4, UARTF_USE_UART4_PC10PC11, UARTF_USE_UART4_PA0PA1
// #define UARTF_USE_UART5, UARTF_USE_UART5_PC12PD2
// #define UARTF_USE_UART6, UARTF_USE_UART6_PG14PG9
// #define UARTF_USE_UART7, UARTF_USE_UART7_PE8PE7, UARTF_USE_UART7_PF7PF6
// #define UARTF_USE_UART8, UARTF_USE_UART8_PE1PE0
// #define UARTF_USE_LPUART1, UARTF_USE_LPUART1_PA2PA3, UARTF_USE_LPUART1_PC1PC0
//
// #define UARTF_BAUD
//
// #define UARTF_USE_TX
// #define UARTF_TXBUFSIZE
// #define UARTF_USE_TX_ISR
// #define UARTF_USE_TX_DMA
// #define UARTF_INVERTED
//
// #define UARTF_USE_RX
// #define UARTF_RXBUFSIZE
//
// #define UARTF_IRQ_PRIORITY
//
// #define UARTF_USE_RXERRORCOUNT
//
// #define UARTF_RX_CALLBACK_FULL(c)
// #define UARTF_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UARTF_H
#define STDSTM32_UARTF_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART, and some STM32F0!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART, and some STM32!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTF_USE_TX_ISR) && (!defined UARTF_USE_TX)
  #error UARTF_USE_TX_ISR used without UARTF_USE_TX!
#endif
#if (defined UARTF_USE_RXERRORCOUNT) && (!defined UARTF_USE_RX)
  #error UARTF_USE_RXERRORCOUNT used without UARTF_USE_RX!
#endif

#ifdef UARTF_USE_TX_DMA
  #error UARTF_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTF_BAUD
  #define UARTF_BAUD             115200UL // 9600UL
#endif


#ifdef UARTF_USE_TX_ISR
  #ifndef UARTF_TXBUFSIZE
    #define UARTF_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTF_TXBUFSIZE < 2
    #error UARTF_TXBUFSIZE must be larger than 1 !
  #elif ((UARTF_TXBUFSIZE & (UARTF_TXBUFSIZE-1)) != 0)
    #error UARTF_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTF_TXBUFSIZEMASK  (UARTF_TXBUFSIZE-1)

  volatile char uartf_txbuf[UARTF_TXBUFSIZE];
  volatile uint16_t uartf_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uartf_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTF_USE_RX
  #ifndef UARTF_RXBUFSIZE
    #define UARTF_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTF_RXBUFSIZE < 2
    #error UARTF_RXBUFSIZE must be larger than 1 !
  #elif ((UARTF_RXBUFSIZE & (UARTF_RXBUFSIZE-1)) != 0)
    #error UARTF_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTF_RXBUFSIZEMASK  (UARTF_RXBUFSIZE-1)

  volatile char uartf_rxbuf[UARTF_RXBUFSIZE];
  volatile uint16_t uartf_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uartf_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTF_USE_RXERRORCOUNT
  volatile uint32_t uartf_errorcnt_rxnoise;
  volatile uint32_t uartf_errorcnt_rxframe;
  volatile uint32_t uartf_errorcnt_rxoverrun;
  #endif
#endif


// catch legacy defines
#if defined UARTF_USE_UART1_REMAPPED || defined UARTF_USE_UART1_REMAPPED2
  #error REMAPPED not supported anymore!
#endif
#if defined UARTF_USE_UART2_REMAPPED || defined UARTF_USE_UART2_REMAPPED2 || defined UARTF_USE_UART2_REMAPPED3
  #error REMAPPED not supported anymore!
#endif
#if defined UARTF_USE_UART3_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTF_USE_UART4_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTF_USE_UART6_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTF_USE_UART7_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTF_USE_LPUART1_REMAPPED
  #error REMAPPED not supported anymore!
#endif


#if defined UARTF_USE_UART1 || defined UARTF_USE_UART1_PA9PA10 || defined UARTF_USE_UART1_PB6PB7 || defined UARTF_USE_UART1_PC4PC5
  #define UARTF_UARTx             USART1
  #ifdef UARTF_USE_UART1
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART1_PA9PA10
    #define UARTF_TX_IO           IO_PA9
    #define UARTF_RX_IO           IO_PA10
  #elif defined UARTF_USE_UART1_PB6PB7 // was UART1_REMAPPED
    #define UARTF_TX_IO           IO_PB6
    #define UARTF_RX_IO           IO_PB7
  #elif defined UARTF_USE_UART1_PC4PC5 // only G4 // was UART1_REMAPPED2
    #define UARTF_TX_IO           IO_PC4
    #define UARTF_RX_IO           IO_PC5
  #endif
  #ifndef STM32F0
    #define UARTF_IO_AF           IO_AF_7
  #else
    #ifdef UARTF_USE_UART1
      // user needs to specify UARTF_USE_IO_AF
    #elif defined UARTF_USE_UART1_PA9PA10
      #define UARTF_IO_AF         IO_AF_1
    #elif defined UARTF_USE_UART1_PB6PB7
      #define UARTF_IO_AF         IO_AF_0
    #else
      #error UARTF_USE_UART1 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTF_IRQn              USART1_IRQn
  #define UARTF_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

#elif defined UARTF_USE_UART2 || defined UARTF_USE_UART2_PA2PA3 || defined UARTF_USE_UART2_PD5PD6 || defined UARTF_USE_UART2_PB3PB4 || defined UARTF_USE_UART2_PA14PA15
  #define UARTF_UARTx             USART2
  #ifdef UARTF_USE_UART2
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART2_PA2PA3
    #define UARTF_TX_IO           IO_PA2
    #define UARTF_RX_IO           IO_PA3
  #elif defined UARTF_USE_UART2_PD5PD6 // was UART2_REMAPPED
    #define UARTF_TX_IO           IO_PD5
    #define UARTF_RX_IO           IO_PD6
  #elif defined UARTF_USE_UART2_PB3PB4 // only G4 // was UART2_REMAPPED2
    #define UARTF_TX_IO           IO_PB3
    #define UARTF_RX_IO           IO_PB4
  #elif defined UARTF_USE_UART2_PA14PA15 // only G4, F0 // ATTENTION: on G4 PA14 overlaps with SWCLK // was UART2_REMAPPED3
    #define UARTF_TX_IO           IO_PA14
    #define UARTF_RX_IO           IO_PA15
  #endif
  #ifndef STM32F0
    #define UARTF_IO_AF           IO_AF_7
  #else
    #if defined UARTF_USE_UART2
      // user needs to specify UARTF_USE_IO_AF
    #elif defined UARTF_USE_UART2_PA2PA3 || defined UARTF_USE_UART2_PA14PA15
      #define UARTF_IO_AF         IO_AF_1
    #else
      #error UARTF_USE_UART2 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTF_IRQn              USART2_IRQn
  #define UARTF_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

#elif defined UARTF_USE_UART3 || defined UARTF_USE_UART3_PB10PB11 || defined UARTF_USE_UART3_PC10PC11 || defined UARTF_USE_UART3_PB8PB9
  #define UARTF_UARTx             USART3
  #if defined UARTF_USE_UART3
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART3_PB10PB11
    #define UARTF_TX_IO           IO_PB10
    #define UARTF_RX_IO           IO_PB11
  #elif defined UARTF_USE_UART3_PC10PC11 // was UART3_REMAPPED
    #define UARTF_TX_IO           IO_PC10
    #define UARTF_RX_IO           IO_PC11
  #elif defined UARTF_USE_UART3_PB8PB9 // only F3
    #define UARTF_TX_IO           IO_PB8
    #define UARTF_RX_IO           IO_PB9
  #else
  #endif
  #ifndef STM32F0
    #define UARTF_IO_AF           IO_AF_7
  #else
    #if defined UARTF_USE_UART3
      // user needs to specify UARTF_USE_IO_AF
    #elif defined defined UARTF_USE_UART3_PB10PB11 || defined UARTF_USE_UART3_PB8PB9
      #define UARTF_IO_AF         IO_AF_4
    #elif defined UARTF_USE_UART3_PC10PC11
      #define UARTF_IO_AF         IO_AF_1
    #else
      #error UARTF_USE_UART3 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTF_IRQn              USART3_IRQn
  #define UARTF_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTF_IRQn
    #undef UARTF_IRQHandler
    #define UARTF_IRQn            USART3_4_IRQn
    #define UARTF_IRQHandler      USART3_4_IRQHandler
  #endif

#elif defined UARTF_USE_UART4 || defined UARTF_USE_UART4_PC10PC11 || defined UARTF_USE_UART4_PA0PA1
  #define UARTF_UARTx             UART4
  #ifdef UARTF_USE_UART4
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART4_PC10PC11
    #define UARTF_TX_IO           IO_PC10
    #define UARTF_RX_IO           IO_PC11
  #elif defined UARTF_USE_UART4_PA0PA1 // only F7 // was UART4_REMAPPED
    #define UARTF_TX_IO           IO_PA0
    #define UARTF_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UARTF_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UARTF_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTF_IO_AF           IO_AF_5
  #endif
  #define UARTF_IRQn              UART4_IRQn
  #define UARTF_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UARTF IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTF_IRQn
    #undef UARTF_IRQHandler
    #define UARTF_IRQn            USART3_4_IRQn
    #define UARTF_IRQHandler      USART3_4_IRQHandler
  #endif

#elif defined UARTF_USE_UART5 || defined UARTF_USE_UART5_PC12PD2
  #define UARTF_UARTx             UART5
  #ifdef UARTF_USE_UART5
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART5_PC12PD2
    #define UARTF_TX_IO           IO_PC12
    #define UARTF_RX_IO           IO_PD2
  #endif
  #define UARTF_IRQn              UART5_IRQn
  #define UARTF_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTF_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTF IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTF_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTF_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #endif

#elif defined UARTF_USE_UART6 || defined UARTF_USE_UART6_PG14PG9
  #define UARTF_UARTx             USART6
  #ifdef UARTF_USE_UART6
    // user needs to specify UARTF_USE_TX_IO, UARTF_USE_RX_IO, and possibly UARTF_USE_IO_AF
  #elif defined UARTF_USE_UART6_PC6PC7
    #define UARTF_TX_IO           IO_PC6
    #define UARTF_RX_IO           IO_PC7
  #elif defined UARTF_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UARTF_TX_IO           IO_PG14
    #define UARTF_RX_IO           IO_PG9
  #endif
  #define UARTF_IO_AF             IO_AF_8
  #define UARTF_IRQn              USART6_IRQn
  #define UARTF_IRQHandler        USART6_IRQHandler

